pulse-compute/pulse-esp32-host/firmware/sdkconfig.defaults
# R0 defaults for ESP32-S3 shell bring-up.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# Prefer PSRAM-equipped S3 modules for the runtime stages.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_USE_MALLOC=y
